tutorials/channel_poletto/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField uniform 0.025;

boundaryField
{
    bottomWall
    {
        type            kqRWallFunction;
        value           uniform 0.25;
    }
    topWall
    {
        type            kqRWallFunction;
        value           uniform 0.25;
    }
    sides_half0
    {
        type            cyclic;
    }
    sides_half1
    {
        type            cyclic;
    }

    inlet   
    { 
         type turbulentIntensityKineticEnergyInlet; 
         intensity 0.05; 
         value uniform 0.25;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
